app/views/movies/show.html.haml


-if @movie.reviews.count > 0
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = 24
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = 15