app/controllers/moviegoers_controller.rb

  def index
  	@moviegoers =  Moviegoer.all
---
SELECT "moviegoers".* FROM "moviegoers"

	def show
	  id = params[:id] # retrieve moviegoer ID from URI route
	  @moviegoer = Moviegoer.find(id) # look up moviegoer by unique ID
---
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? LIMIT 1  [["id", "3"]]

	def edit
		@moviegoer = Moviegoer.find params[:id]
---
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? LIMIT 1  [["id", "3"]]