app/controllers/movies_controller.rb

	def create
		@movie = Movie.new(params[:movie])
		if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def update
		@movie = Movie.find params[:id]
		if @movie.update_attributes(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "movies" SET "release_date" = '2005-08-16 00:00:00.000000', "updated_at" = '2015-08-16 09:51:00.850274' WHERE "movies"."id" = 24