app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comments", "movie_id", "moviegoer_id", "potatoes") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comments", "1"], ["movie_id", 1], ["moviegoer_id", 1], ["potatoes", 1]]
---
  def create
    # since moviegoer_id is a protected attribute that won't get
    # assigned by the mass-assignment from params[:review], we set it
    # by using the << method on the association.  We could also
    # set it manually with review.moviegoer = @current_user.
    @current_user.reviews << @movie.reviews.build(params[:review])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
#  debugger
		@review = Review.find params[:id]

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "reviews" SET "comments" = 'Wow!!!!!' WHERE "reviews"."id" = 7
---
  def update
    @review = Review.find params[:id]
    if @review.update_attributes(params[:movie])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]
---
  def destroy
 #   debugger
    @review =  Review.find(params[:id])
    @review.destroy