app/controllers/sessions_controller.rb

	def create
#    debugger
    auth = request.env["omniauth.auth"]

    user = Moviegoer.find_by_provider_and_uid(auth["provider"], auth["uid"]) ||
      Moviegoer.create_with_omniauth(auth)
---
INSERT INTO "moviegoers" ("admin", "created_at", "name", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["admin", false], ["created_at", Wed, 16 Sep 2015 14:47:23 UTC +00:00], ["name", "Piet Poen"], ["provider", "twitter"], ["uid", "219309654"], ["updated_at", Wed, 16 Sep 2015 14:47:23 UTC +00:00]]
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = 'twitter' AND "moviegoers"."uid" = '219309654' LIMIT 1